Revit 2026 API

# RoofBaseFasciaDepth Property

---

Retrieve or set the FasciaDepth.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FasciaDepth { get; set; }
```
```vb
Public Property FasciaDepth As Double
	Get
	Set
```
```cpp
public:
property double FasciaDepth {
	double get ();
	void set (double value);
}
```
```fsharp
member FasciaDepth : float with get, set
```

#### Property Value

Double

If the EaveCutterType is PlumbCut, this property doesn't make sense.

#### Reference

RoofBase Class

Autodesk.Revit.DB Namespace